virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/classd.h
/* -------- CLASSD_THR : (CLASSD Offset: 0x10) (R/W 32) Transmit Holding Register -------- */
#define CLASSD_THR_LDATA_Pos                  _U_(0)                                               /**< (CLASSD_THR) Left Channel Data Position */
#define CLASSD_THR_LDATA_Msk                  (_U_(0xFFFF) << CLASSD_THR_LDATA_Pos)                /**< (CLASSD_THR) Left Channel Data Mask */
#define CLASSD_THR_LDATA(value)               (CLASSD_THR_LDATA_Msk & ((value) << CLASSD_THR_LDATA_Pos))
#define CLASSD_THR_RDATA_Pos                  _U_(16)                                              /**< (CLASSD_THR) Right Channel Data Position */
#define CLASSD_THR_RDATA_Msk                  (_U_(0xFFFF) << CLASSD_THR_RDATA_Pos)                /**< (CLASSD_THR) Right Channel Data Mask */
#define CLASSD_THR_RDATA(value)               (CLASSD_THR_RDATA_Msk & ((value) << CLASSD_THR_RDATA_Pos))
#define CLASSD_THR_Msk                        _U_(0xFFFFFFFF)                                      /**< (CLASSD_THR) Register Mask  */


/* -------- CLASSD_IER : (CLASSD Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define CLASSD_IER_DATRDY_Pos                 _U_(0)                                               /**< (CLASSD_IER) Data Ready Position */
#define CLASSD_IER_DATRDY_Msk                 (_U_(0x1) << CLASSD_IER_DATRDY_Pos)                  /**< (CLASSD_IER) Data Ready Mask */
#define CLASSD_IER_DATRDY(value)              (CLASSD_IER_DATRDY_Msk & ((value) << CLASSD_IER_DATRDY_Pos))
#define CLASSD_IER_Msk                        _U_(0x00000001)                                      /**< (CLASSD_IER) Register Mask  */


/* -------- CLASSD_IDR : (CLASSD Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define CLASSD_IDR_DATRDY_Pos                 _U_(0)                                               /**< (CLASSD_IDR) Data Ready Position */
#define CLASSD_IDR_DATRDY_Msk                 (_U_(0x1) << CLASSD_IDR_DATRDY_Pos)                  /**< (CLASSD_IDR) Data Ready Mask */
#define CLASSD_IDR_DATRDY(value)              (CLASSD_IDR_DATRDY_Msk & ((value) << CLASSD_IDR_DATRDY_Pos))
#define CLASSD_IDR_Msk                        _U_(0x00000001)                                      /**< (CLASSD_IDR) Register Mask  */


/* -------- CLASSD_IMR : (CLASSD Offset: 0x1C) (R/W 32) Interrupt Mask Register -------- */
#define CLASSD_IMR_DATRDY_Pos                 _U_(0)                                               /**< (CLASSD_IMR) Data Ready Position */
#define CLASSD_IMR_DATRDY_Msk                 (_U_(0x1) << CLASSD_IMR_DATRDY_Pos)                  /**< (CLASSD_IMR) Data Ready Mask */
#define CLASSD_IMR_DATRDY(value)              (CLASSD_IMR_DATRDY_Msk & ((value) << CLASSD_IMR_DATRDY_Pos))
#define CLASSD_IMR_Msk                        _U_(0x00000001)                                      /**< (CLASSD_IMR) Register Mask  */


/* -------- CLASSD_ISR : (CLASSD Offset: 0x20) ( R/ 32) Interrupt Status Register -------- */
#define CLASSD_ISR_DATRDY_Pos                 _U_(0)                                               /**< (CLASSD_ISR) Data Ready Position */
#define CLASSD_ISR_DATRDY_Msk                 (_U_(0x1) << CLASSD_ISR_DATRDY_Pos)                  /**< (CLASSD_ISR) Data Ready Mask */
#define CLASSD_ISR_DATRDY(value)              (CLASSD_ISR_DATRDY_Msk & ((value) << CLASSD_ISR_DATRDY_Pos))
#define CLASSD_ISR_Msk                        _U_(0x00000001)                                      /**< (CLASSD_ISR) Register Mask  */


/* -------- CLASSD_WPMR : (CLASSD Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define CLASSD_WPMR_WPEN_Pos                  _U_(0)                                               /**< (CLASSD_WPMR) Write Protection Enable Position */
#define CLASSD_WPMR_WPEN_Msk                  (_U_(0x1) << CLASSD_WPMR_WPEN_Pos)                   /**< (CLASSD_WPMR) Write Protection Enable Mask */
#define CLASSD_WPMR_WPEN(value)               (CLASSD_WPMR_WPEN_Msk & ((value) << CLASSD_WPMR_WPEN_Pos))
#define CLASSD_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (CLASSD_WPMR) Write Protection Key Position */
#define CLASSD_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << CLASSD_WPMR_WPKEY_Pos)             /**< (CLASSD_WPMR) Write Protection Key Mask */
#define CLASSD_WPMR_WPKEY(value)              (CLASSD_WPMR_WPKEY_Msk & ((value) << CLASSD_WPMR_WPKEY_Pos))
#define   CLASSD_WPMR_WPKEY_PASSWD_Val        _U_(0x434C44)                                        /**< (CLASSD_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define CLASSD_WPMR_WPKEY_PASSWD              (CLASSD_WPMR_WPKEY_PASSWD_Val << CLASSD_WPMR_WPKEY_Pos) /**< (CLASSD_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define CLASSD_WPMR_Msk                       _U_(0xFFFFFF01)                                      /**< (CLASSD_WPMR) Register Mask  */


/** \brief CLASSD register offsets definitions */
#define CLASSD_CR_REG_OFST             (0x00)              /**< (CLASSD_CR) Control Register Offset */
#define CLASSD_MR_REG_OFST             (0x04)              /**< (CLASSD_MR) Mode Register Offset */
#define CLASSD_INTPMR_REG_OFST         (0x08)              /**< (CLASSD_INTPMR) Interpolator Mode Register Offset */
#define CLASSD_INTSR_REG_OFST          (0x0C)              /**< (CLASSD_INTSR) Interpolator Status Register Offset */
#define CLASSD_THR_REG_OFST            (0x10)              /**< (CLASSD_THR) Transmit Holding Register Offset */
#define CLASSD_IER_REG_OFST            (0x14)              /**< (CLASSD_IER) Interrupt Enable Register Offset */
#define CLASSD_IDR_REG_OFST            (0x18)              /**< (CLASSD_IDR) Interrupt Disable Register Offset */
#define CLASSD_IMR_REG_OFST            (0x1C)              /**< (CLASSD_IMR) Interrupt Mask Register Offset */
#define CLASSD_ISR_REG_OFST            (0x20)              /**< (CLASSD_ISR) Interrupt Status Register Offset */
#define CLASSD_WPMR_REG_OFST           (0xE4)              /**< (CLASSD_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CLASSD register API structure */
typedef struct
{
  __O   uint32_t                       CLASSD_CR;          /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       CLASSD_MR;          /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       CLASSD_INTPMR;      /**< Offset: 0x08 (R/W  32) Interpolator Mode Register */
  __I   uint32_t                       CLASSD_INTSR;       /**< Offset: 0x0C (R/   32) Interpolator Status Register */
  __IO  uint32_t                       CLASSD_THR;         /**< Offset: 0x10 (R/W  32) Transmit Holding Register */
  __O   uint32_t                       CLASSD_IER;         /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       CLASSD_IDR;         /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __IO  uint32_t                       CLASSD_IMR;         /**< Offset: 0x1C (R/W  32) Interrupt Mask Register */
  __I   uint32_t                       CLASSD_ISR;         /**< Offset: 0x20 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved1[0xC0];
  __IO  uint32_t                       CLASSD_WPMR;        /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} classd_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_CLASSD_COMPONENT_H_ */
